[
  {
    "MealName": "Margherita Pizza",
    "MealPicture": "margheritapizza",
    "MealDescription": "Indulge in a timeless Italian classic with our mouthwatering Margherita Pizza, crafted to perfection for discerning palates at our esteemed restaurant. This culinary masterpiece features a thin, crispy crust adorned with a vibrant symphony of flavors. Picture luscious vine-ripened tomatoes, hand-picked basil leaves, and creamy mozzarella cheese, harmonizing effortlessly atop a bed of tangy tomato sauce. Each bite is a sensory delight, with the delicate balance of sweet, savory, and herbal notes dancing across your taste buds. Savor the simplicity and elegance of Italian cuisine with our Margherita Pizza, a culinary journey that captures the essence of tradition and taste.",
    "MealType": "Entree",
    "MealPrice": "10.99",
    "MealRating": "4.5/5",
    "MealTime": "25 min",
    "MealCalories": "800",
    "MealIngredients": "Pizza dough, tomato sauce, fresh mozzarella cheese, fresh basil, olive oil"
  },
  {
    "MealName": "BBQ Chicken Pizza",
    "MealPicture": "bbqpizza",
    "MealDescription": "This irresistible creation boasts a perfectly crisp crust, forming the foundation for a symphony of textures and tastes. Succulent, slow-roasted, and shredded BBQ chicken takes center stage, its smoky sweetness balanced by the tangy kiss of our signature BBQ sauce. A vibrant medley of toppings adds a symphony of color and flavor: crisp red onion slices for a touch of sharpness, and fresh cilantro sprigs for a burst of herbal vibrancy. All of this culinary harmony rests upon a bed of melted mozzarella cheese, ensuring a delightful textural contrast in every bite. Savor the smoky indulgence and delightful tang of our BBQ Chicken Pizza, a guaranteed crowd-pleaser that will leave you wanting more.",
    "MealType": "Entree",
    "MealPrice": "12.99",
    "MealRating": "4.7/5",
    "MealTime": "30 min",
    "MealCalories": "900",
    "MealIngredients": "Pizza dough, BBQ sauce, grilled chicken breast, red onions, cilantro, mozzarella cheese"
  },
  {
    "MealName": "Vegetable Stir-Fry",
    "MealPicture": "vegetablestirfry",
    "MealType": "Entree",
    "MealDescription": "This vibrant stir-fry bursts with a symphony of fresh, crisp-tender vegetables, each showcasing its unique flavor and texture. Tender broccoli florets and snow peas dance alongside colorful bell peppers, their sweetness countered by the earthy depth of sliced mushrooms. All are expertly stir-fried to maintain a delightful snap, creating a textural contrast that keeps you coming back for more.The vegetables are bathed in a light and savory sauce, infused with a touch of garlic and ginger for aromatic depth. A hint of soy sauce adds a subtle umami richness, perfectly complementing the natural sweetness of the vegetables.This healthy and flavorful dish can be enjoyed on its own for a satisfying light meal, or served alongside protein like tofu, chicken, or shrimp for a more complete and protein-packed entree.",
    "MealPrice": "9.99",
    "MealRating": "4.3/5",
    "MealTime": "20 min",
    "MealCalories": "600",
    "MealIngredients": "Bell peppers, broccoli, carrots, snap peas, tofu, soy sauce, sesame oil"
  },
  {
    "MealName": "Classic Cheeseburger",
    "MealPicture": "classicheeseburger",
    "MealDescription": "This timeless creation features a perfectly seared, all-beef patty cooked to your desired doneness. The foundation for a symphony of textures and flavors, the patty rests on a toasted brioche bun, its buttery richness complementing the savory goodness. Nestled within is a classic combination of toppings: tangy slices of tomato, crisp iceberg lettuce, and creamy mayonnaise add pops of color and contrasting textures. Melted American cheese drapes luxuriously over the patty, delivering a satisfying gooeyness in every bite. This iconic burger is a guaranteed crowd-pleaser, a perfect example of culinary comfort food done right.",
    "MealType": "Entree",
    "MealPrice": "8.99",
    "MealRating": "4.6/5",
    "MealTime": "15 min",
    "MealCalories": "850",
    "MealIngredients": "Beef patty, cheddar cheese, lettuce, tomato, onions, pickles, ketchup, sesame seed bun"
  },
  {
    "MealName": "Mushroom Risotto",
    "MealPicture": "mushroomrisotto",
    "MealDescription": "Indulge in the earthy embrace of our Mushroom Risotto. Creamy Arborio rice forms a luxurious canvas for a symphony of savory delights. Plump, pan-seared mushrooms lend their rich umami essence, while a hint of white wine adds a touch of acidity for a perfectly balanced flavor profile. Freshly grated Parmesan cheese weaves a thread of salty richness throughout, while a touch of butter ensures a silky-smooth texture in every decadent bite. This vegetarian masterpiece is a celebration of simple ingredients brought together in perfect harmony, offering a comforting and soul-satisfying culinary experience.",
    "MealType": "Entree",
    "MealPrice": "11.99",
    "MealRating": "4.4/5",
    "MealTime": "35 min",
    "MealCalories": "750",
    "MealIngredients": "Arborio rice, mushrooms, onions, garlic, white wine, vegetable broth, parmesan cheese, parsley"
  },
  {
    "MealName": "Veggie Deluxe Sandwich",
    "MealPicture": "veggiesandwich",
    "MealDescription": "Unveiling a symphony of fresh flavors, the Veggie Deluxe Sandwich is a vegetarian masterpiece built on hearty whole grain bread. This delightful creation starts with a creamy foundation of hummus, offering a smooth and savory base. Layers of vibrant roasted red peppers add a touch of sweetness, while crisp cucumber slices provide a refreshing counterpoint. Sprouts burst with a delightful nuttiness, and luscious avocado delivers a rich, buttery flavor. Fresh lettuce adds a touch of coolness, and juicy tomato contributes a burst of acidity. Each bite brings a delightful textural contrast, from the soft creaminess of the hummus and avocado to the satisfying crunch of the sprouts and the crispness of the vegetables. This vegetarian delight is a perfect harmony of taste and texture, guaranteed to leave you wanting more.",
    "MealType": "Entree",
    "MealPrice": "9.49",
    "MealRating": "4.8/5",
    "MealTime": "10 min",
    "MealCalories": "700",
    "MealIngredients": "Hummus, avocado, cucumber, roasted red peppers, sprouts, lettuce, tomato, whole grain bread"
  },
  {
    "MealName": "Spaghetti Bolognese",
    "MealPicture": "spaghettibologne",
    "MealDescription": "Immerse yourself in the comfort of a classic with our Spaghetti Bolognese. Tender strands of pasta are bathed in a rich, slow-braised meat sauce, simmered to perfection for a depth of flavor that unfolds with every bite. Our hearty Bolognese boasts a melody of ground beef and pork, seasoned with aromatic vegetables and simmered in simmered in a vibrant tomato base. A touch of red wine and fresh herbs adds complexity, while a generous dusting of parmesan cheese provides a delightful salty finish. This timeless Italian dish is a culinary embrace, promising a heartwarming and satisfying experience.",
    "MealType": "Entree",
    "MealPrice": "13.49",
    "MealRating": "4.7/5",
    "MealTime": "40 min",
    "MealCalories": "900",
    "MealIngredients": "Spaghetti noodles, ground beef, tomatoes, onions, garlic, herbs, parmesan cheese"
  },
  {
    "MealName": "Falafel Wrap",
    "MealPicture": "falafelwrap",
    "MealDescription": "Dive into a symphony of textures and flavors with our Falafel Wrap. A warm pita bread pocket forms the base for this delightful creation. Inside, discover golden falafel – a symphony of chickpeas, herbs, and spices – perfectly fried for a satisfying crunch. A cool and creamy tahini sauce adds a touch of sesame richness, while fresh chopped vegetables like cucumber and tomato deliver vibrant pops of flavor and refreshing coolness. Tangy pickled onions offer a delightful contrast, and crisp lettuce adds a touch of textural intrigue. Each bite is a harmonious blend of savory falafel, cool sauces, and refreshing vegetables, making this wrap a vegetarian triumph.",
    "MealType": "Entree",
    "MealPrice": "10.99",
    "MealRating": "4.6/5",
    "MealTime": "25 min",
    "MealCalories": "650",
    "MealIngredients": "Falafel balls, lettuce, tomato, cucumber, pickled turnips, tahini sauce, pita bread"
  },
  {
    "MealName": "Tropical Smoothie",
    "MealPicture": "mangosmoothie",
    "MealDescription": "Unveiling a tropical escape in a glass, our Mango Smoothie is a symphony of sunshine and refreshment. Sun-ripened mangoes, bursting with juicy sweetness, form the base of this delightful beverage. Creamy yogurt adds a touch of tang and velvety texture, creating a luxurious mouthfeel. A hint of citrus awakens the senses, while a whisper of honey accentuates the mango's natural sweetness. This vibrant concoction is a perfect pick-me-up, a delightful afternoon treat, or a healthy way to indulge your sweet tooth. Escape the ordinary and embrace the tropics with every sip of our irresistible Mango Smoothie.",
    "MealType": "Drink",
    "MealPrice": "5.99",
    "MealRating": "4.5",
    "MealTime": "5 min",
    "MealCalories": "200",
    "MealIngredients": "Pineapple, mango, banana, coconut water"
  },
  {
    "MealName": "Iced Matcha Latte",
    "MealPicture": "icedmatchalatee",
    "MealDescription": "This refreshing beverage offers a captivating contrast of color and taste. A vibrant emerald tide of meticulously whisked matcha tea forms the base, boasting a smooth, vegetal depth. Hints of natural sweetness peek through, perfectly complementing the subtle earthiness. A layer of chilled milk, light and airy, creates a creamy canvas that tempers the intensity of the matcha, inviting you to indulge with every sip. Finished with a dusting of green tea powder, this iced latte is a visual and textural delight, offering a cool and invigorating escape from the ordinary.",
    "MealType": "Drink",
    "MealPrice": "4.99",
    "MealRating": "4.7",
    "MealTime": "5 min",
    "MealCalories": "150",
    "MealIngredients": "Matcha powder, milk, sweetener (optional)"
  },
  {
    "MealName": "Classic Mojito",
    "MealPicture": "mojito",
    "MealDescription": "This refreshing cocktail is a timeless testament to the power of simplicity. A symphony of cool and bright flavors unfolds with each sip. The foundation is built upon premium white rum, its smooth warmth balanced by the zest of freshly squeezed limes. Muddled mint leaves release their invigorating aroma, intertwining with a touch of sugar for a subtle sweetness. Finally, a splash of club soda adds a touch of effervescence, creating a light and inviting finish. This iconic concoction is a testament to the perfect harmony achieved with just a few well-chosen ingredients",
    "MealType": "Drink",
    "MealPrice": "7.99",
    "MealRating": "4.8",
    "MealTime": "10 min",
    "MealCalories": "180",
    "MealIngredients": "Mint leaves, lime juice, sugar, soda water, rum (optional)"
  },
  {
    "MealName": "Vanilla Chai Latte",
    "MealPicture": "vanillachailatte",
    "MealDescription": "Unveiled in a comforting embrace of warmth, our Vanilla Chai Latte is a captivating melody of spiced and sweet. The foundation rests upon a canvas of rich, frothed milk, its smooth texture the perfect stage for the star of the show: a captivating blend of chai spices. Cardamom, cinnamon, and ginger weave their magic, their aromatic notes swirling in perfect harmony. A touch of vanilla adds a touch of creamy sweetness, creating a delightful counterpoint to the chai's exotic warmth. This soothing symphony is presented in a tall glass, inviting you to savor the captivating dance of flavors in every sip. Indulge in the comforting embrace of our Vanilla Chai Latte, a soul-warming experience that will leave you wanting more.",
    "MealType": "Drink",
    "MealPrice": "4.99",
    "MealRating": "4.6",
    "MealTime": "5 min",
    "MealCalories": "250",
    "MealIngredients": "Chai tea concentrate, milk, vanilla syrup"
  },
  {
    "MealName": "Dragon Fruit Smoothie",
    "MealPicture": "dragonfruitsmoothie",
    "MealDescription": "This vibrant beverage is a tastebud adventure, bursting with the sweet and tangy essence of the exotic dragon fruit. Its vibrant magenta hue hints at the explosion of flavors within. The creamy base, made with fresh or frozen bananas and milk of your choice, offers a smooth and refreshing foundation. The star of the show, dragon fruit, adds a touch of floral sweetness perfectly balanced by the subtle citrus notes.\nFor a touch of tropical luxury, we've swirled in a hint of pineapple or mango, creating a symphony of sweet and tart flavors. This delightful smoothie is a perfect way to start your day, replenish your energy after a workout, or simply enjoy a taste of the tropics any time.",
    "MealType": "Drink",
    "MealPrice": "6.99",
    "MealRating": "4.7",
    "MealTime": "5 min",
    "MealCalories": "220",
    "MealIngredients": "Dragon fruit, yogurt, honey, mango, pineapple"
  },
  {
    "MealName": "Café Latte",
    "MealPicture": "cafelatte",
    "MealDescription": "Indulge in the timeless elegance of our Café Latte. This meticulously crafted beverage features a bold shot of espresso layered with smooth, frothed milk, creating a symphony of textures and flavors. The rich, dark espresso forms the base, offering a robust and invigorating coffee experience. Silky smooth steamed milk complements the espresso's intensity, creating a harmonious balance of bitter and creamy. A touch of microfoam rests atop the beverage, adding a delightful textural element and a beautiful presentation. Savor the Café Latte, a perfect pick-me-up or a sophisticated accompaniment to any pastry or light meal.",
    "MealType": "Drink",
    "MealPrice": "3.99",
    "MealRating": "4.5",
    "MealTime": "5 min",
    "MealCalories": "120",
    "MealIngredients": "Espresso, milk"
  },
  {
    "MealName": "Chocolate Lava Cake",
    "MealPicture": "chocolavacake",
    "MealDescription": "Unveiling a decadent masterpiece, our Chocolate Lava Cake is a celebration of rich, molten chocolate encased in a warm, pillowy shell. Each bite is a textural adventure, beginning with a delicate crackle through the crisp, caramelized exterior. Inside awaits a molten chocolate center, its luxurious intensity a symphony of pure, dark cocoa bliss. Imagine a warm, enveloping wave of chocolate flooding your senses – that's the essence of this delightful dessert. A touch of sweetness lingers on the palate, perfectly complementing the richness of the chocolate.  Indulge in pure chocolate decadence with our unforgettable Chocolate Lava Cake.",
    "MealType": "Dessert",
    "MealPrice": "7.99",
    "MealRating": "4.8/5",
    "MealTime": "40 min",
    "MealCalories": "600 calories",
    "MealIngredients": "Chocolate, butter, sugar, eggs, flour, vanilla extract, vanilla ice cream, chocolate sauce"
  },
  {
    "MealName": "Tiramisu Cheese Cake",
    "MealPicture": "teramisucheesecake",
    "MealDescription": "Indulge in the decadence of our Tiramisu Cheesecake, a marriage of two classic desserts in one unforgettable creation. This masterpiece features a rich and crumbly cocoa cookie crust, the perfect base for a lusciously smooth mascarpone cheesecake filling. Hints of coffee dance throughout the creamy center, a delightful echo of the iconic Italian dessert. Nestled within the filling is a layer of ladyfingers, delicately soaked in espresso and Kahlúa for a touch of boozy delight. A final flourish of cocoa powder adorns the top, a visual and textural reminder of the chocolatey foundation. Each bite offers a symphony of textures and flavors, from the satisfying crunch of the crust to the velvety creaminess of the filling, punctuated by the subtle coffee notes and the hint of ladyfinger. This is a dessert experience unlike any other, a must-try for cheesecake and tiramisu aficionados alike.",
    "MealType": "Dessert",
    "MealPrice": "8.99",
    "MealRating": "4.7/5",
    "MealTime": "45 min",
    "MealCalories": "500 calories",
    "MealIngredients": "Ladyfingers, espresso, mascarpone cheese, eggs, sugar, cocoa powder, rum"
  },
  {
    "MealName": "Apple Pie",
    "MealPicture": "applepiemama",
    "MealDescription": "Indulge in the timeless allure of our Homemade Apple Pie. Encased in a flaky, golden brown crust, a symphony of textures and flavors awaits. Tender, slow-cooked apples, their natural sweetness brought to life with a hint of cinnamon, form the heart of this classic dessert. A touch of lemon juice adds a refreshing brightness, while a sprinkle of sugar creates a delightful caramelized crown. Each slice offers a delightful textural contrast – the buttery, melt-in-your-mouth crust yielding to the warm, yielding softness of the apples. This iconic dessert is sure to warm hearts and satisfy cravings, a perfect ending to any meal.",
    "MealType": "Dessert",
    "MealPrice": "6.99",
    "MealRating": "4.6/5",
    "MealTime": "50 min",
    "MealCalories": "550 calories",
    "MealIngredients": "Apples, sugar, flour, butter, cinnamon, nutmeg, lemon juice, pie crust, vanilla ice cream"
  }
]